{
  "architectures": [
    "SegformerForSemanticSegmentation"
  ],
  "attention_probs_dropout_prob": 0.0,
  "classifier_dropout_prob": 0.1,
  "decoder_hidden_size": 256,
  "depths": [
    2,
    2,
    2,
    2
  ],
  "downsampling_rates": [
    1,
    4,
    8,
    16
  ],
  "drop_path_rate": 0.1,
  "dtype": "float32",
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_sizes": [
    32,
    64,
    160,
    256
  ],
  "id2label": {
    "0": "background",
    "1": "building_flooded",
    "2": "building_non_flooded",
    "3": "road_flooded",
    "4": "road_non_flooded",
    "5": "water",
    "6": "tree",
    "7": "vehicle",
    "8": "pool",
    "9": "grass"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "label2id": {
    "background": 0,
    "building_flooded": 1,
    "building_non_flooded": 2,
    "grass": 9,
    "pool": 8,
    "road_flooded": 3,
    "road_non_flooded": 4,
    "tree": 6,
    "vehicle": 7,
    "water": 5
  },
  "layer_norm_eps": 1e-06,
  "mlp_ratios": [
    4,
    4,
    4,
    4
  ],
  "model_type": "segformer",
  "num_attention_heads": [
    1,
    2,
    5,
    8
  ],
  "num_channels": 3,
  "num_encoder_blocks": 4,
  "patch_sizes": [
    7,
    3,
    3,
    3
  ],
  "reshape_last_stage": true,
  "semantic_loss_ignore_index": 255,
  "sr_ratios": [
    8,
    4,
    2,
    1
  ],
  "strides": [
    4,
    2,
    2,
    2
  ],
  "transformers_version": "4.57.2"
}
